
zs = {
    'pos': '战士',
    'HP': 125,
    'MP': 40,
    'att': 18,
    'baoji': 0.032,
    'xiaoguo': 1.7,
    'shanghai': 1.8,
    'menu': '看这装扮似乎是一个神秘地方的英雄，但愿真的是个英雄吧！',
}

fs = {
    'pos': '法师',
    'HP': 100,
    'MP': 85,
    'att': 10,
    'baoji': 0.023,
    'xiaoguo': 1.5,
    'shanghai': 2.2,
    'menu': '有的人表面上是个法师，实际上也就只是个普普通通的法师！',
}

ck = {
    'pos': '刺客',
    'HP': 75,
    'MP': 100,
    'att': 20,
    'baoji': 0.065,
    'xiaoguo': 1.7,
    'shanghai': 2.3,
    'menu': '你为刺杀某个大人物潜伏了进来，在这里说不定会遇到你的同行！',
}

gj = {
    'pos': '弓箭手',
    'HP': 60,
    'MP': 30,
    'att': 15,
    'baoji': 0.14,
    'xiaoguo': 1.65,
    'shanghai': 1.05,
    'menu': '一般来说瞎了一只眼睛的弓箭手瞄得都很准，所以你双目失明了！',
}
